Validation_PINN_OF/airFoil_PINN_Validation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0.29708 0.04175 0);

boundaryField {
    inlet {
        type fixedValue;
        value uniform (0.29708 0.04175 0);
    }

    outlet {
        type zeroGradient;
    }

    walls {
        type fixedValue;
        value uniform (0.29708 0.04175 0);
    }

    airfoil {
        type noSlip;
    }

    frontAndBack {
        type empty;
    }
}

// ************************************************************************* //