Validation_PINN_OF/airFoil_PINN_Validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       137571;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       137771;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       137971;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          122218;
        startFace       138571;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3232;
        startFace       260789;
    }
)

// ************************************************************************* //
