Validation_PINN_OF/airFoil_PINN_Validation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
vertices (
    (-1.0 -1.0 -0.05) (2.0 -1.0 -0.05) (2.0 1.0 -0.05) (-1.0 1.0 -0.05)
    (-1.0 -1.0 0.05) (2.0 -1.0 0.05) (2.0 1.0 0.05) (-1.0 1.0 0.05)
);
blocks ( hex (0 1 2 3 4 5 6 7) (300 200 1) simpleGrading (1 1 1) );
edges ();
boundary (
    inlet { type patch; faces ((0 3 7 4)); }
    outlet { type patch; faces ((1 5 6 2)); }
    walls { type wall; faces ((0 1 5 4) (3 2 6 7)); }
    frontAndBack { type empty; faces ((4 5 6 7) (0 3 2 1)); }
);
