Validation_PINN_OF/airFoil_PINN_Validation/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    airfoil.stl
    {
        type triSurfaceMesh;
        name airfoil;
    }
};

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;

    features
    (
    );

    refinementSurfaces
    {
        airfoil
        {
            level (2 2);
        }
    }

    refinementRegions
    {
    //    airfoil
    //    {
    //        mode distance;
    //        levels ((0.1 2) (0.3 2));
    //    }
    }

    locationInMesh (0.5 0.5 0.0);
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 10;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;
    layers {}
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
}

meshQualityControls
{
    #include "meshQualityDict"
}

mergeTolerance 1e-6;

// ************************************************************************* //

